benchmarks/results/auth-serialization/test-signin/baseline/wrk2-logs/run_1_1805_1312.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 841.420ms, rate sampling interval: 2187ms
  Thread calibration: mean lat.: 835.447ms, rate sampling interval: 2187ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   856.46ms  229.35ms   1.12s    50.00%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  646.66ms
 75.000%    1.09s 
 90.000%    1.10s 
 99.000%    1.10s 
 99.900%    1.12s 
 99.990%    1.12s 
 99.999%    1.12s 
100.000%    1.12s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     608.255     0.000000            2         1.00
     617.983     0.100000            6         1.11
     623.615     0.200000           12         1.25
     631.807     0.300000           18         1.43
     637.439     0.400000           25         1.67
     646.655     0.500000           30         2.00
    1061.887     0.550000           33         2.22
    1065.983     0.600000           36         2.50
    1071.103     0.650000           39         2.86
    1083.391     0.700000           42         3.33
    1085.439     0.750000           45         4.00
    1089.535     0.775000           47         4.44
    1093.631     0.800000           48         5.00
    1099.775     0.825000           52         5.71
    1099.775     0.850000           52         6.67
    1100.799     0.875000           56         8.00
    1100.799     0.887500           56         8.89
    1100.799     0.900000           56        10.00
    1100.799     0.912500           56        11.43
    1100.799     0.925000           56        13.33
    1101.823     0.937500           58        16.00
    1101.823     0.943750           58        17.78
    1101.823     0.950000           58        20.00
    1101.823     0.956250           58        22.86
    1101.823     0.962500           58        26.67
    1104.895     0.968750           59        32.00
    1104.895     0.971875           59        35.56
    1104.895     0.975000           59        40.00
    1104.895     0.978125           59        45.71
    1104.895     0.981250           59        53.33
    1117.183     0.984375           60        64.00
    1117.183     1.000000           60          inf
#[Mean    =      856.457, StdDeviation   =      229.353]
#[Max     =     1116.160, Total count    =           60]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90 requests in 30.02s, 120.41KB read
Requests/sec:      3.00
Transfer/sec:      4.01KB