benchmarks/results/auth-serialization/test-signin/baseline/wrk2-logs/run_2_1805_1313.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 850.249ms, rate sampling interval: 2172ms
  Thread calibration: mean lat.: 838.963ms, rate sampling interval: 2199ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   857.39ms  227.92ms   1.11s    47.54%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04s 
 75.000%    1.08s 
 90.000%    1.10s 
 99.000%    1.10s 
 99.900%    1.11s 
 99.990%    1.11s 
 99.999%    1.11s 
100.000%    1.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     604.671     0.000000            1         1.00
     614.911     0.100000            7         1.11
     623.103     0.200000           13         1.25
     630.271     0.300000           20         1.43
     634.367     0.400000           25         1.67
    1044.991     0.500000           31         2.00
    1060.863     0.550000           34         2.22
    1065.983     0.600000           37         2.50
    1075.199     0.650000           40         2.86
    1080.319     0.700000           43         3.33
    1083.391     0.750000           46         4.00
    1086.463     0.775000           49         4.44
    1086.463     0.800000           49         5.00
    1092.607     0.825000           52         5.71
    1092.607     0.850000           52         6.67
    1095.679     0.875000           55         8.00
    1095.679     0.887500           55         8.89
    1095.679     0.900000           55        10.00
    1096.703     0.912500           56        11.43
    1099.775     0.925000           57        13.33
    1103.871     0.937500           59        16.00
    1103.871     0.943750           59        17.78
    1103.871     0.950000           59        20.00
    1103.871     0.956250           59        22.86
    1103.871     0.962500           59        26.67
    1104.895     0.968750           60        32.00
    1104.895     0.971875           60        35.56
    1104.895     0.975000           60        40.00
    1104.895     0.978125           60        45.71
    1104.895     0.981250           60        53.33
    1107.967     0.984375           61        64.00
    1107.967     1.000000           61          inf
#[Mean    =      857.394, StdDeviation   =      227.918]
#[Max     =     1106.944, Total count    =           61]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90 requests in 30.01s, 120.41KB read
Requests/sec:      3.00
Transfer/sec:      4.01KB