benchmarks/results/auth-serialization/test-signin/baseline/wrk2-logs/run_3_1805_1314.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 838.007ms, rate sampling interval: 2181ms
  Thread calibration: mean lat.: 835.379ms, rate sampling interval: 2177ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   857.01ms  228.79ms   1.14s    46.67%
    Req/Sec     1.00      0.00     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  694.78ms
 75.000%    1.09s 
 90.000%    1.10s 
 99.000%    1.11s 
 99.900%    1.14s 
 99.990%    1.14s 
 99.999%    1.14s 
100.000%    1.14s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     610.303     0.000000            1         1.00
     612.863     0.100000            6         1.11
     626.175     0.200000           12         1.25
     632.319     0.300000           18         1.43
     634.367     0.400000           24         1.67
     694.783     0.500000           30         2.00
    1061.887     0.550000           33         2.22
    1068.031     0.600000           36         2.50
    1073.151     0.650000           39         2.86
    1079.295     0.700000           42         3.33
    1089.535     0.750000           46         4.00
    1090.559     0.775000           49         4.44
    1090.559     0.800000           49         5.00
    1094.655     0.825000           52         5.71
    1094.655     0.850000           52         6.67
    1096.703     0.875000           54         8.00
    1096.703     0.887500           54         8.89
    1096.703     0.900000           54        10.00
    1098.751     0.912500           56        11.43
    1098.751     0.925000           56        13.33
    1102.847     0.937500           57        16.00
    1102.847     0.943750           57        17.78
    1102.847     0.950000           57        20.00
    1104.895     0.956250           58        22.86
    1104.895     0.962500           58        26.67
    1108.991     0.968750           59        32.00
    1108.991     0.971875           59        35.56
    1108.991     0.975000           59        40.00
    1108.991     0.978125           59        45.71
    1108.991     0.981250           59        53.33
    1142.783     0.984375           60        64.00
    1142.783     1.000000           60          inf
#[Mean    =      857.011, StdDeviation   =      228.788]
#[Max     =     1141.760, Total count    =           60]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90 requests in 30.01s, 120.41KB read
Requests/sec:      3.00
Transfer/sec:      4.01KB